/* Localizable strings not stored in nib files and not stored in application resources, */
/* the strings below can be accessed using the GetBundleLocalizedString() macro, those */
/* stored in application resources must be accessed using GetLocalizedString() instead. */

"kSerialNumberUserLimit" = "%d-client license";

"kSerialNumberUserLimitNoLimit" = "Unlimited-client license";

"kSerialNumberUserLimitUnknown" = "Not available";

"kSerialNumberUserLimitNotSupported" = "Not available in 10.2 server";

"kInvalidSerialNumber" = "Invalid serial number";

"kLastSerialNumberInvalid" = "The serial number (%@) is invalid. Please enter a correct serial number.";

"kNeverExpires" = "Never expires";

"kExpiresOn" = "Expires on: ";

"kRendezvousNameNotSupported" = "Not available in 10.2 server";

"kBootTimeNotSupported" = "Not available in 10.2 server";

"kDateFormatter" = "%c";

"AF_INET" = "IPv4";

"AF_INET6" = "IPv6";

"kSWUpdateStatePrefix" = "Status: ";

"kNewSoftwareIsAvailable" = "New software is available for your server.";

"kSoftwareIsUpToDate" = "Your server's software is up to date.";

"kClickCheckNow" = "Click on Check Now to check for available updates.";

"kMissingBackendSWUpdateTool" = "Missing custom backend tool (your server needs a new version of softwareupdate tool)";

"kSWUDescriptionsNotAvailablePreLeopard" = "Software Update descriptions are only available when connected to Mac OS X Server 10.5 or later.";

"kReadyForInstall" = "Ready to install";

"kInstallNoItems" = "Install";  /* Install button text when disabled */

"kInstallOneItem" = "Install 1 item";

"kInstallMultipleItems" = "Install %d items";

"kErrorCode" = "Error code: ";

"kAbbreviatedBytes" = "B";

"kRebootInProgress" = "Server is restarting, please wait for the connection to be re-established…";

"kRebootServerAlertTtl" = "Are you sure you want to restart this server now?";

"kRebootServerAlertMsg" = "Connection with %@ will be momentarily lost.";

"kIgnoreUpdateAlertSingleTtl" = "Are you sure you want to remove the update \"%@\" from the list?";

"kIgnoreUpdateAlertMultipleTtl" = "Are you sure you want to remove these %d updates from the list?";

"kIgnoreUpdateAlertMsg" = "You will no longer be notified of new versions of this update. To see this update again, click the Reset Ignored Updates button.";

"kRebootButton" = "Restart";

"kZeroConfExplanationFormatString" = "Computers on the server's local subnet will be able to reach it at <%@.local>.";

"kUGQuotasNotSupported" = "Users and groups quotas are not available in 10.2 server";

"kUGQuotasNotAvailable" = "No users and groups quotas";

"kCancelButton" = "Cancel";

"kDeleteButton" = "Delete";

"kAllServiceAccessDragHint" = "All users and groups are allowed to access all services on this server. To restrict access to all services, click the add button and drag users and groups into this list.";

"kServiceAccessDragHint" = "This service allows access by all users or groups. To restrict access, click the add button and drag users and groups into this list.";

"kAllServiceAccessRestrictedDragHint" = "No users or groups are allowed to access services on this server. Click the add button and drag users and groups into this list to give them access.";

"kServiceAccessRestrictedDragHint" = "This service does not allow access to any users or groups. Click the add button and drag users and groups into this list to give them access.";

"kAllServiceAdminDragHint" = "Only members of the Admin group can administer services on this server. Click the add button and drag users and groups into this list to allow additional administrators or monitors.";

"kServiceAdminDragHint" = "Only members of the Admin group can administer this service. Click the add button and drag users and groups into this list to allow additional administrators or monitors.";

"kServiceAccessRestrictedString" = "Service access is restricted";

"kAddGroupMembersToolTip" = "Add group members";

"kRemoveGroupMembersToolTip" = "Remove selected group members";

"kSummaryCPUUsageFormatter" = "%.2f %% CPU load";

"kSummaryThrouputPerSecFormatter" = "%@/sec";

"kNewNotifyAddress" = "user@server.com";

"kCPUGraphName" = "CPU Usage (total)";

"kNetworkGraphName" = "Network Traffic";

"kOverviewCPUGraphTitle" = "CPU %";

"kOverviewNetGraphTitle" = "Network Throughput";

"kOverviewDiskGraphTitle" = "Disks";

"kOverviewSingleDiskGraphTitle" = "Disk";

"kOverviewNetGraphPeakFormat" = "Peak: %@%@";

"kProcOverviewFormat" = "%@%@ %@";

"kProcOverviewSpeedFormat" = "%1.1f GHz";

"kProcOverviewNumFormat" = "%d x ";

"kDiskUsageToolTipFormat" = "%@\n%@ of %@ used (%d%%)";

"kSharingTabName" = "File Sharing";

"kCertsTabName" = "Certificates"; 

"kSACLLongNameFormat" = "%@ ACL";

"kAdminCLLongNameFormat" = "%@ Administrators";

"kMonitorCLongNameFormat" = "%@ Monitors";

"kRemoteLoginGroupName" = "Remote Login Group";

/* Services for Server Permissions */

"service_addressbook" = "Address Book" ;

"service_afp" = "AFP";

"service_calendar" = "iCal" ;

"service_certs" = "Certificates"; 

"service_cluster" = "Cluster" ;

"service_dhcp" = "DHCP" ;

"service_dirserv" = "Open Directory";

"service_dns" = "DNS" ;

"service_ftp" = "FTP";

"service_chat" = "iChat";

"service_ipfilter" = "Firewall" ;

"service_jabber" = "iChat" ;

"service_mail" = "Mail";

"service_loginwindow" = "Login Window";

"service_mysql" = "MySQL" ;

"service_nat" = "NAT" ;

"service_netboot" = "NetBoot" ;

"service_notification" = "Push Notification" ;

"service_nfs" = "NFS" ;

"service_pcast" = "Podcast Producer" ;

"service_print" = "Print" ;

"service_proxy" = "Mobile Access" ;

"service_qtss" = "QuickTime Streaming";

"service_radius" = "RADIUS";

"service_sharing" = "File Sharing";

"service_smb" = "SMB";

"service_swupdate" = "Software Update" ;

"service_vpn" = "VPN";

"service_web" = "Web";

"service_webobjects" = "WebObjects" ;

"service_xgrid" = "Xgrid";

"service_ssh" = "SSH";

"service_weblog" = "Blog";

"service_all_services" = "All Services";


/* Permission Types for Tiered Admin */

"kAdministerPermissionType" = "Administer" ;
"kMonitorPermissionType" = "Monitor" ;

/* Quota on/off error message*/

"kSetVolumeQuotaFailedTitle" = "Volume quota settings failed";

"kSetVolumeQuotaFailedMessage" = "The attempt to change quota settings on a volume failed. Please try again.";


/* Log files (keys come from back-end): unfortunately those get ordered by the XML deserializer so system log may not show first unless code is hacked */

"systemLog" = "System Log"; /* 10.2+ */

"kernelLog" = "Kernel Log"; /* 10.6+ */

"watchdogEvtLog" = "Watchdog Event Log"; /* 10.2 & 10.3 */

"softwareUpdateLog" = "Software Update Log"; /* 10.3+ */

"radminEvtLog" = "Server Settings Event Log"; /* 10.2 */

"radminErrLog" = "Server Settings Error Log"; /* 10.2 */

"secureLog" = "Secure Log"; /* 10.5+ */


/* Log names (these go in the popup button) */

"System Log" = "System Log";

"Secure Log" = "Secure Log";


/* Most common errors */

"NOT_ENOUGH_PRIVS_ERR" = "Insufficient privileges (must be administrator)";


/* Result codes of startSWUpdateScan and startSWUpdateInstall commands (SWUpdate) */

"RESTART_REQUIRED" = "You should now restart your server";

"REQUEST_STARTED" = "Checking for new software…";

"REQUEST_QUEUED" = "Checking for new software… (request queued)";

"PARAMETER_ERROR" = "Parameter error";


/* Valid phases (SWUpdate) */

"WAITING" = "Waiting"; /* Author hasn't witnessed this state yet */

"SCANNING" = "Scanning";

"UPTODATE" = "Up to date";

"DOWNLOADING" = "Downloading";

"UNARCHIVING" = "Unarchiving";

"INSTALLING" = "Installing";

"INSTALLATION" = "Installation";

"OPTIMIZING" = "Optimizing"; /* Author witnessed this (but without progress) */

"UNKNOWN" = "Unknown"; /* Author hasn't witnessed this state yet */

"RESTARTING" = "Restarting"; /* Author hasn't witnessed this state yet */

"DONE" = "Installed";


/* Phase status codes (SWUpdate) */

"INPROGRESS" = "in progress"; /* Author witnessed this with Scanning */

"ERROR" = "Failed";

"DONE-MUST_BE_RENAMED" = "done"; /* Author hasn't witnessed this state yet */


/* Phase error codes (SWUpdate) */

"SUScanServerErrorResultCode" = "Software Update returned an error";

"SUScanNetworkErrorResultCode" = "could not connect to the Internet";


/* Configuration error codes */

"kSerialNumberMissingCharactersErrorString" = "The serial number (%@) is missing one or more characters";

"kEmptyRendezvousNameErrorString" = "The Bonjour name can not be left blank";

"kEmptyComputerNameErrorString" = "The Computer name can not be left blank";


/* Most common errors (server-side) */

"100001" = "could not update hostconfig file"; /* COULD_NOT_UPDATE_HOSTCONFIG_ERR */

"100002" = "could not get SNMP state"; /* COULD_NOT_GET_SNMP_STATE_ERR */

"100003" = "could not start SNMP"; /* COULD_NOT_START_SNMP_ERR */

"100004" = "could not stop SNMP"; /* COULD_NOT_STOP_SNMP_ERR */

"100010" = "invalid computer name"; /* INVALID_COMPUTER_NAME_ERR */

"100011" = "could not set Bonjour name"; /* COULD_NOT_WRITE_ZEROCONF_NAME_ERR */

"100012" = "could not set computer name"; /* COULD_NOT_WRITE_COMPUTER_NAME_ERR */

"100020" = "could not unlink locatime file"; /* COULD_NOT_UNLINK_LOCALTIME_FILE_ERR */

"100021" = "could not access time zone file"; /* COULD_NOT_ACCESS_TIMEZONE_FILE_ERR */

"100022" = "could not link time zone file"; /* COULD_NOT_SYMLINK_TIMEZONE_FILE_ERR */

"100023" = "could not set time of day"; /* COULD_NOT_SET_TIME_OF_DAY_ERR */

"100025" = "could not get SSH state"; /* COULD_NOT_GET_SSH_STATE_ERR */

"100026" = "could not start SSH"; /* COULD_NOT_START_SSH_ERR */

"100027" = "could not stop SSH"; /* COULD_NOT_STOP_SSH_ERR */

"100028" = "could not get ARD state"; /* COULD_NOT_GET_ARD_STATE_ERR */

"100029" = "could not start ARD"; /* COULD_NOT_START_ARD_ERR */

"100030" = "could not stop ARD"; /* COULD_NOT_STOP_ARD_ERR */

"100031" = "could not start FileSync agent"; /* COULD_NOT_START_FILESYNCD_ERR */

"100032" = "could not stop FileSync agent"; /* COULD_NOT_STOP_FILESYNCD_ERR */

"100038" = "duplicate serial number"; /* DUPLICATE_REGISTERED_LICENSE_ERR */

"100039" = "serial number already registered"; /* ALREADY_REGISTERED_LICENSE_ERR */

"100040" = "could not register serial number"; /* CANNOT_REGISTER_LICENSE_ERR */

"100041" = "invalid serial number"; /* INVALID_LICENSE_ERR */

"100042" = "could not check license with daemon"; /* LICENSE_DAEMON_COMMUNICATION_ERR */

"100043" = "could not check license because of firewall"; /* LICENSE_FIREWALL_COMMUNICATION_ERR */

"100044" = "could not check license"; /* LICENSE_PARAMETER_ERR */

"100045" = "could not store serial number"; /* CANNOT_STORE_LICENSE_ERR */

"100046" = "could not retrieve serial number"; /* CANNOT_RETRIEVE_LICENSE_ERR */

"100047" = "expired serial number"; /* EXPIRED_LICENSE_ERR */

"-300002" = "invalid serial number"; /* SNInvalidSerialNumberErr - Obsolete in 10.4 */

